Hyp-ed/hyped-2024/src/stm32_blinky/stm32f4xx_hal_conf.h
/* ########################## Assert Selection ############################## */
/**
 * @brief Uncomment the line below to expanse the "assert_param" macro in the
 *        HAL drivers code
 */
/* #define USE_FULL_ASSERT    1U */

/* ################## Ethernet peripheral configuration ##################### */

/* Section 1 : Ethernet peripheral configuration */

/* MAC ADDRESS: MAC_ADDR0:MAC_ADDR1:MAC_ADDR2:MAC_ADDR3:MAC_ADDR4:MAC_ADDR5 */
#define MAC_ADDR0 2U
#define MAC_ADDR1 0U
#define MAC_ADDR2 0U
#define MAC_ADDR3 0U
#define MAC_ADDR4 0U
#define MAC_ADDR5 0U

/* Definition of the Ethernet driver buffers size and count */
#define ETH_RX_BUF_SIZE ETH_MAX_PACKET_SIZE /* buffer size for receive               */
#define ETH_TX_BUF_SIZE ETH_MAX_PACKET_SIZE /* buffer size for transmit              */
#define ETH_RXBUFNB 4U                      /* 4 Rx buffers of size ETH_RX_BUF_SIZE  */
#define ETH_TXBUFNB 4U                      /* 4 Tx buffers of size ETH_TX_BUF_SIZE  */

/* Section 2: PHY configuration section */

/* DP83848 PHY Address*/
#define DP83848_PHY_ADDRESS 0x01U
/* PHY Reset delay these values are based on a 1 ms Systick interrupt*/
#define PHY_RESET_DELAY 0x000000FFU
/* PHY Configuration delay */
#define PHY_CONFIG_DELAY 0x00000FFFU

#define PHY_READ_TO 0x0000FFFFU
#define PHY_WRITE_TO 0x0000FFFFU

/* Section 3: Common PHY Registers */

#define PHY_BCR ((std::uint16_t)0x0000) /*!< Transceiver Basic Control Register   */
#define PHY_BSR ((std::uint16_t)0x0001) /*!< Transceiver Basic Status Register    */

#define PHY_RESET ((std::uint16_t)0x8000)           /*!< PHY Reset */
#define PHY_LOOPBACK ((std::uint16_t)0x4000)        /*!< Select loop-back mode */
#define PHY_FULLDUPLEX_100M ((std::uint16_t)0x2100) /*!< Set the full-duplex mode at 100 Mb/s */
#define PHY_HALFDUPLEX_100M ((std::uint16_t)0x2000) /*!< Set the half-duplex mode at 100 Mb/s */
#define PHY_FULLDUPLEX_10M ((std::uint16_t)0x0100)  /*!< Set the full-duplex mode at 10 Mb/s  */
#define PHY_HALFDUPLEX_10M ((std::uint16_t)0x0000)  /*!< Set the half-duplex mode at 10 Mb/s  */
#define PHY_AUTONEGOTIATION ((std::uint16_t)0x1000) /*!< Enable auto-negotiation function     */
#define PHY_RESTART_AUTONEGOTIATION                                                                \
  ((std::uint16_t)0x0200)                     /*!< Restart auto-negotiation function */
#define PHY_POWERDOWN ((std::uint16_t)0x0800) /*!< Select the power down mode           */
#define PHY_ISOLATE ((std::uint16_t)0x0400)   /*!< Isolate PHY from MII                 */

#define PHY_AUTONEGO_COMPLETE ((std::uint16_t)0x0020) /*!< Auto-Negotiation process completed   */
#define PHY_LINKED_STATUS ((std::uint16_t)0x0004)     /*!< Valid link established               */
#define PHY_JABBER_DETECTION ((std::uint16_t)0x0002)  /*!< Jabber condition detected            */

/* Section 4: Extended PHY Registers */

#define PHY_SR ((std::uint16_t)0x0010)   /*!< PHY status register Offset                      */
#define PHY_MICR ((std::uint16_t)0x0011) /*!< MII Interrupt Control Register                  */
#define PHY_MISR ((std::uint16_t)0x0012) /*!< MII Interrupt Status and Misc. Control Register */

#define PHY_LINK_STATUS                                                                            \
  ((std::uint16_t)0x0001) /*!< PHY Link mask                                   */
#define PHY_SPEED_STATUS ((std::uint16_t)0x0002)  /*!< PHY Speed mask  */
#define PHY_DUPLEX_STATUS ((std::uint16_t)0x0004) /*!< PHY Duplex mask */

#define PHY_MICR_INT_EN                                                                            \
  ((std::uint16_t)0x0002) /*!< PHY Enable interrupts                           */
#define PHY_MICR_INT_OE                                                                            \
  ((std::uint16_t)0x0001) /*!< PHY Enable output interrupt events              */

#define PHY_MISR_LINK_INT_EN                                                                       \
  ((std::uint16_t)0x0020) /*!< Enable Interrupt on change of link status       */
#define PHY_LINK_INTERRUPT                                                                         \
  ((std::uint16_t)0x2000) /*!< PHY link status interrupt mask                  */

/* ################## SPI peripheral configuration ########################## */

/* CRC FEATURE: Use to activate CRC feature inside HAL SPI Driver
 * Activated: CRC code is present inside driver
 * Deactivated: CRC code cleaned from driver
 */

#define USE_SPI_CRC 1U

/* Includes ------------------------------------------------------------------*/
/**
 * @brief Include module's header file
 */

#ifdef HAL_RCC_MODULE_ENABLED
#include "stm32f4xx_hal_rcc.h"
#endif /* HAL_RCC_MODULE_ENABLED */

#ifdef HAL_GPIO_MODULE_ENABLED
#include "stm32f4xx_hal_gpio.h"
#endif /* HAL_GPIO_MODULE_ENABLED */

#ifdef HAL_EXTI_MODULE_ENABLED
#include "stm32f4xx_hal_exti.h"
#endif /* HAL_EXTI_MODULE_ENABLED */

#ifdef HAL_DMA_MODULE_ENABLED
#include "stm32f4xx_hal_dma.h"
#endif /* HAL_DMA_MODULE_ENABLED */

#ifdef HAL_CORTEX_MODULE_ENABLED
#include "stm32f4xx_hal_cortex.h"
#endif /* HAL_CORTEX_MODULE_ENABLED */

#ifdef HAL_ADC_MODULE_ENABLED
#include "stm32f4xx_hal_adc.h"
#endif /* HAL_ADC_MODULE_ENABLED */

#ifdef HAL_CAN_MODULE_ENABLED
#include "stm32f4xx_hal_can.h"
#endif /* HAL_CAN_MODULE_ENABLED */

#ifdef HAL_CAN_LEGACY_MODULE_ENABLED
#include "stm32f4xx_hal_can_legacy.h"
#endif /* HAL_CAN_LEGACY_MODULE_ENABLED */

#ifdef HAL_CRC_MODULE_ENABLED
#include "stm32f4xx_hal_crc.h"
#endif /* HAL_CRC_MODULE_ENABLED */

#ifdef HAL_CRYP_MODULE_ENABLED
#include "stm32f4xx_hal_cryp.h"
#endif /* HAL_CRYP_MODULE_ENABLED */

#ifdef HAL_DMA2D_MODULE_ENABLED
#include "stm32f4xx_hal_dma2d.h"
#endif /* HAL_DMA2D_MODULE_ENABLED */

#ifdef HAL_DAC_MODULE_ENABLED
#include "stm32f4xx_hal_dac.h"
#endif /* HAL_DAC_MODULE_ENABLED */

#ifdef HAL_DCMI_MODULE_ENABLED
#include "stm32f4xx_hal_dcmi.h"
#endif /* HAL_DCMI_MODULE_ENABLED */

